app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT `employees`.* FROM `employees`

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE `employees` SET `employees`.`name` = 'budis', `employees`.`updated_at` = '2023-06-14 01:43:47.960735' WHERE `employees`.`id` = 1

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1