app/controllers/spendings_controller.rb

SELECT `spendings`.* FROM `spendings`
---
  def index
    @spendings = Spending.all

SELECT `spendings`.* FROM `spendings` WHERE `spendings`.`id` = 1 LIMIT 1
---
    def set_spending
      @spending = Spending.find(params[:id])